Catalogs/бтБитФонАбонентыНаПрослушку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>бтБитФонАбонентыНаПрослушку</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бтБитФонАбонентыНаПрослушку/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ЗначениеЗаполнено(Номер) И ЭтоНовый() Тогда
		Если ПроверитьДубли(Номер) Тогда
			Сообщить("Номер " + Формат(Номер,"ЧГ=") + " уже присутствует в списке выбора. Укажите другой номер.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
	
   Пользователь =   бит_БИТфонСервер.ПолучитьТекущегоПользователя();
   	
КонецПроцедуры

Функция ПроверитьДубли(ЗнчДляПроверки)
	
	ДубльЗнчЕсть = Ложь;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бтБитФонАбонентыНаПрослушку.Номер
	               |ИЗ
	               |	Справочник.бтБитФонАбонентыНаПрослушку КАК бтБитФонАбонентыНаПрослушку
	               |ГДЕ
	               |	бтБитФонАбонентыНаПрослушку.Номер = &Номер
	               |	И бтБитФонАбонентыНаПрослушку.ПометкаУдаления = ЛОЖЬ
	               |	И бтБитФонАбонентыНаПрослушку.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Номер",ЗнчДляПроверки);
	Запрос.УстановитьПараметр("Пользователь",бит_БИТфонСервер.ПолучитьТекущегоПользователя());
	Выборка = Запрос.Выполнить();
	Если Не Выборка.Пустой() Тогда
		ДубльЗнчЕсть = Истина;	
	КонецЕсли;
	
	Возврат ДубльЗнчЕсть;
КонецФункции
